sngenvertex_manager.org
#+TITLE:  SNGenvertex Manager Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-10-20
#+OPTIONS: ^:{}

* Introduction
This file holds some vertex generators related to SuperNEMO detector geometry.

* Manager configuration
:PROPERTIES:
:HEADER-ARGS: :tangle sngenvertex_manager.conf
:END:

** Logging priority
#+BEGIN_SRC shell
  #@description Logging priority
  logging.priority : string = @variant(core:logging_priority|"warning")
#+END_SRC

** Vertices list of files
The following code defines the location of several vertices files. All of them
are defined in Section [[Vertex configuration]].

#+BEGIN_SRC shell
  #@variant_if geometry:layout/if_basic|true

  #@description Names of the files configuring the list of registered vertex generators
  vg_list : string[5] as path =                                                            \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/scin_vg.lis"    \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/tracker_vg.lis" \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/shield_vg.lis"  \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/source_vg.lis"  \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/source_calibration_vg.lis"

  #@description The name of the default vertex generator to be used
  #@variant_only !geometry:layout/if_basic/source_calibration/is_active|true
  generator : string = "source_pads_bulk"

  #@variant_only geometry:layout/if_basic/source_calibration/is_active|false
  generator : string = "source_calibration_all_spots"

  #@variant_endif

  #@variant_if geometry:layout/if_half_commissioning|false
  #@description Names of the files configuring the list of registered vertex generators
  vg_list : string[3] as path =                                                            \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/scin_vg.lis"    \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/tracker_vg.lis" \
    "@falaise:config/snemo/demonstrator/simulation/vertexes/4.0/generators/commissioning_vg.lis"

  #@description The name of the default vertex generator to be used
  generator : string = "all_commissioning_spots"

  #@variant_endif
#+END_SRC

#+BEGIN_SRC shell :tangle no
  #@description Names of the files configuring the list of registered vertex generators
  vg_list : string[5] as path =     \
    "@configuration:scin_vg.lis"    \
    "@configuration:tracker_vg.lis" \
    "@configuration:source_vg.lis"  \
    "@configuration:hall_vg.lis"    \
    "@configuration:calibration_vg.lis"
#+END_SRC

* Vertex configuration
This section defines several vertices configuration :
- [[Scintillator vertices][Scintillator vertices]]: to generate external events coming from calorimeter
  walls,
- [[Tracker vertices][Tracker vertices]]: to generate events from the internal drift chamber either on
  wires surface or inside gas tracking,
- [[Source vertices][Source vertices]]: to produce 2\beta events or to simulate source contamination.
- [[External vertices][External vertices]]: to generate events from outside the detector like neutrons

