sngenvertex_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SNGenvertex Manager Configuration</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<link rel="stylesheet" href="css/styles.css" />
               <link rel="stylesheet" href="css/org-pygments.css" />
               <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.1.0/css/font-awesome.min.css" />
  <div id="spinner">
    <div id="bounce1"></div>
    <div id="bounce2"></div>
    <div id="bounce3"></div>
    <small>Loading MathJax...</small>
  </div>
</head>
<body onload="randomLinkColor();displayTOC();"><div id="toc"></div>
<div id="preamble" class="status">
 <a href="https://github.com/xgarrido/snemo_simulation_configuration"><i class="fa fa-github"></i></a><br/> 
</div>
<div id="content">
<h1 class="title">SNGenvertex Manager Configuration</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline5">2. Manager configuration</a>
<ul>
<li><a href="#orgheadline2">2.1. Logging priority</a></li>
<li><a href="#orgheadline4">2.2. Vertices list of files</a></li>
</ul>
</li>
<li><a href="#orgheadline3">3. Vertex configuration</a>
<ul>
<li><a href="#orgheadline6">3.1. Scintillator vertices</a></li>
<li><a href="#orgheadline7">3.2. Tracker vertices</a></li>
<li><a href="#orgheadline8">3.3. Source vertices</a></li>
<li><a href="#orgheadline9">3.4. External vertices</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file holds some vertex generators related to SuperNEMO detector geometry.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">2</span> Manager configuration</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Logging priority</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.2</span> Vertices list of files</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The following code defines the location of several vertices files. All of them
are defined in Section <a href="#orgheadline3">3</a>.
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Names of the files configuring the list of registered vertex generators</span>
vg_list : string[4] as <span class="org-variable-name">path</span> =                       <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@SNEMO_SIMULATION_CONFIGURATION@/scin_vg.lis"</span>    <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@SNEMO_SIMULATION_CONFIGURATION@/tracker_vg.lis"</span> <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@SNEMO_SIMULATION_CONFIGURATION@/source_vg.lis"</span>  <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"@SNEMO_SIMULATION_CONFIGURATION@/hall_vg.lis"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Vertex configuration</h2>
<div class="outline-text-2" id="text-3">
<p>
This section defines several vertices configuration :
</p>
<ul class="org-ul">
<li><a href="#orgheadline6">Scintillator vertices</a>: to generate external events coming from calorimeter
walls,</li>
<li><a href="#orgheadline7">Tracker vertices</a>: to generate events from the internal drift chamber either on
wires surface or inside gas tracking,</li>
<li><a href="#orgheadline8">Source vertices</a>: to produce 2&beta; events or to simulate source contamination.</li>
<li><a href="#orgheadline9">External vertices</a>: to generate events from outside the detector like neutrons</li>
</ul>
</div>
