sngenvertex_manager.html

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">3.1</span> Scintillator vertices</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Insert preamble
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of vertex generators</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Generate vertex in the bulk volume of the wrapper for the main calorimeter's
scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"calo_wrapper_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk of the main calorimeter wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">origin : string = "category=calorimeter_wrapper module={*} side={1} column={0;1;2;4;19} row={0;1;2;12;13}"</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='calorimeter_wrapper' module={*} side={*} column={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex in the bulk volume of the wrapper for the X-calorimeter's
scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"xcalo_wrapper_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk of the X-wall calorimeter wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='xcalo_wrapper' module={*} side={*} column={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex in the bulk volume of the wrapper for the &gamma; veto
calorimeter's scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"gveto_wrapper_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk of the gamma veto wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='gveto_wrapper' module={*} side={*} wall={*} column={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex from the surface of the main calorimeter's scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"calo_wrapper_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the main calorimeter wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='calorimeter_wrapper' module={*} side={*} column={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top  : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>

<li><p>
Generate vertex from the surface of the X-calorimeter's scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"xcalo_wrapper_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the X-wall calorimeter wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='xcalo_wrapper' module={*} side={*} column={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top  : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>

<li><p>
Generate vertex from the surface of the &gamma; veto's scintillator blocks:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"gveto_wrapper_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the gamma veto wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='gveto_wrapper' module={*} side={*} wall={*} column={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>

<li><p>
Generate vertex in the PMT glass
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"pmt_glass_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::polycone_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk of the PMT glass wrapper</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='calorimeter_pmt_glass' module={*} side={*} column={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation within polycone material</span>
mode.bulk.body : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generate vertex on all polycone frustrum</span>
polycone.all_frustrum : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>
</ul>
</div>
</div>
