sngenvertex_manager.org
** Tracker vertices
:PROPERTIES:
:HEADER-ARGS: :tangle tracker_vg.lis
:END:

Insert preamble
#+BEGIN_SRC shell
  #@description A list of vertex generators
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

*** Vertices on tracker wires

- Generate vertex from the bulk volume of the anode wires:

  #+BEGIN_SRC shell
    [name="anode_wire_bulk" type="genvtx::cylinder_model_vg"]

    #@config Vertex generation from the bulk volume of the anode wires

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='drift_cell_anodic_wire' module={*} side={*} layer={*} row={*}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "bulk"
  #+END_SRC

- Generate vertex on the surface of the anode wires:

  #+BEGIN_SRC shell
    [name="anode_wire_surface" type="genvtx::cylinder_model_vg"]

    #@config Vertex generation from the surface of the anode wires

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='drift_cell_anodic_wire' module={*} side={*} layer={*} row={*}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "surface"

    #@description Surface mode box side face activation
    mode.surface.side   : boolean = true

    #@description Surface mode box bottom face activation
    mode.surface.bottom : boolean = false

    #@description Surface mode box top face activation
    mode.surface.top    : boolean = false
  #+END_SRC

- Generate vertex on the surface of the field wires:

  #+BEGIN_SRC shell
    [name="field_wire_surface" type="genvtx::cylinder_model_vg"]

    #@config Vertex generation from the surface of the field wires

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='drift_cell_field_wire' module={*} side={*} layer={*} row={*} set={*} wire={*}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "surface"

    #@description Surface mode box side face activation
    mode.surface.side   : boolean = true

    #@description Surface mode box bottom face activation
    mode.surface.bottom : boolean = false

    #@description Surface mode box top face activation
    mode.surface.top    : boolean = false
  #+END_SRC

- Generate vertex from the bulk volume of the field wires:

  #+BEGIN_SRC shell
    [name="field_wire_bulk" type="genvtx::cylinder_model_vg"]

    #@config Vertex generation from the bulk volume of the anode wires

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='drift_cell_field_wire' module={*} side={*} layer={*} row={*}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "bulk"
  #+END_SRC

*** Vertices within tracker volumes (wires included)
**** Generator using category list
This vertex generator is quite classical in the way that it uses the category
file list and especially, the =drift_cell_core= category. This means that
vertices are going to be generated in the cell core, wires included, but not
inside the gap between foil and first tracker layer as well as not within the
gap between the main calorimeter walls and the last tracker layer. In order to
get a full coverage of tracker gaz, you may have a look to the next section.

#+BEGIN_SRC shell
  [name="tracker_drift_cell_bulk" type="genvtx::box_model_vg"]

  #@config Vertex generation from the core of Geiger cell

  #@description Logging priority
  logging.priority  : string = @variant(core:logging_priority|"warning")

  #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
  origin : string = "category='drift_cell_core' module={*} side={*} layer={*} row={*}"

  #@description Generation mode ("surface" or "bulk")
  mode   : string = "bulk"
#+END_SRC

