sngenvertex_manager.html

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.2</span> Tracker vertices</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Insert preamble
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of vertex generators</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">3.2.1</span> Vertices on tracker wires</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li><p>
Generate vertex from the bulk volume of the anode wires:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"anode_wire_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk volume of the anode wires</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='drift_cell_anodic_wire' module={*} side={*} layer={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex on the surface of the anode wires:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"anode_wire_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the anode wires</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='drift_cell_anodic_wire' module={*} side={*} layer={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box side face activation</span>
mode.surface.side   : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box bottom face activation</span>
mode.surface.bottom : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top    : <span class="org-variable-name">boolean</span> = false
</pre>
</div></li>

<li><p>
Generate vertex on the surface of the field wires:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"field_wire_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the field wires</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='drift_cell_field_wire' module={*} side={*} layer={*} row={*} set={*} wire={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box side face activation</span>
mode.surface.side   : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box bottom face activation</span>
mode.surface.bottom : <span class="org-variable-name">boolean</span> = false

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top    : <span class="org-variable-name">boolean</span> = false
</pre>
</div></li>

<li><p>
Generate vertex from the bulk volume of the field wires:
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"field_wire_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::cylinder_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk volume of the anode wires</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='drift_cell_field_wire' module={*} side={*} layer={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">3.2.2</span> Vertices within tracker volumes (wires included)</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ul class="org-ul"><li><a id="orgheadline11"></a>Generator using category list<br  /><div class="outline-text-5" id="text-orgheadline11">
<p>
This vertex generator is quite classical in the way that it uses the category
file list and especially, the <code>drift_cell_core</code> category. This means that
vertices are going to be generated in the cell core, wires included, but not
inside the gap between foil and first tracker layer as well as not within the
gap between the main calorimeter walls and the last tracker layer. In order to
get a full coverage of tracker gaz, you may have a look to the next section.
</p>

<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"tracker_drift_cell_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the core of Geiger cell</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='drift_cell_core' module={*} side={*} layer={*} row={*}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div>
</div></li>
