sngenvertex_manager.org
***** Vertex validation
Here starts the validation configuration. We first add a support to vertex
validation
#+BEGIN_SRC shell
  #@description Vertex validation support
  vertex_validation_support : boolean = true
#+END_SRC
we define the logging level
#+BEGIN_SRC shell
  #@description Maximum number of tries for the rejection method
  validation.logging.priority : string = @variant(core:logging_priority|"warning")
#+END_SRC
and we activate it
#+BEGIN_SRC shell
  #@description Vertex validation activation
  validation.activation : boolean = true
#+END_SRC

We also defines the maximum number of tries for the rejection process; above this
number the vertex generator throws an error.
#+BEGIN_SRC shell
  #@description Maximum number of tries for the rejection method
  validation.maximum_number_of_tries : integer = 1000
#+END_SRC

We finally define the validation id which refers to the =cut= identifiant with
which the validator is registered. Here we want to only keep vertex within the
=tracking_gas= material so we use a =in_materials_vertex_validator=
#+BEGIN_SRC shell
  #@description Vertex validation id
  validation.validator_id : string = "genvtx::in_materials_vertex_validator"
#+END_SRC
and we define the set of materials to be used
#+BEGIN_SRC shell
  #@description List of materials to be used
  validation.validator_params.materials.ref : string[1] = "tracking_gas"
#+END_SRC

We can also set the logging priority and the maximum depth to look inside
#+BEGIN_SRC shell
  # #@description Logging level for validator
  # validation.validator_params.max_depth : integer = 100

  #@description Logging level for validator
  validation.validator_params.logging.priority : string = @variant(core:logging_priority|"warning")
#+END_SRC

** Source vertices
:PROPERTIES:
:HEADER-ARGS: :tangle source_vg.lis
:END:

Since there are two types of source pads namely "internal" and "external" with
different size and then different isotope mass, we first define independent
vertices for each of this model and then use a =genvtx::combined_vg= model to
combine with appropriate weights. These vertices are only available with
SuperNEMO geometry version greater than 2.0.

Insert preamble
#+BEGIN_SRC shell
  #@description A list of vertex generators
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

*** Internal source pads
- Generate vertex from the bulk volume of the source foil:
  #+BEGIN_SRC shell
    [name="source_pads_internal_bulk" type="genvtx::box_model_vg"]

    #@config Vertex generation from the bulk volume of the inner source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='source_strip' module={*} strip=[1;34]"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "bulk"
  #+END_SRC

- Generate vertex from the surface of the source foil:
  #+BEGIN_SRC shell
    [name="source_pads_internal_surface" type="genvtx::box_model_vg"]

    #@config Vertex generation from the surface of the inner source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='source_strip' module={*} strip=[1;34]"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "surface"

    #@description Surface mode box back face activation
    mode.surface.back  : boolean = true

    #@description Surface mode box front face activation
    mode.surface.front : boolean = true
  #+END_SRC

*** External source pads

- Generate vertex from the bulk volume of the source foil:
  #+BEGIN_SRC shell
    [name="source_pads_external_bulk" type="genvtx::box_model_vg"]

    #@config Vertex generation from the bulk volume of the outer source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='source_strip' module={*} strip={0;35}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "bulk"
  #+END_SRC

- Generate vertex from the surface of the source foil:
  #+BEGIN_SRC shell
    [name="source_pads_external_surface" type="genvtx::box_model_vg"]

    #@config Vertex generation from the surface of the outer source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='source_strip' module={*} strip={0;35}"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "surface"

    #@description Surface mode box back face activation
    mode.surface.back  : boolean = true

    #@description Surface mode box front face activation
    mode.surface.front : boolean = true
  #+END_SRC

