sngenvertex_manager.html
validation.validator_params.materials.ref : <span class="org-variable-name">string</span>[1] = <span class="org-string">"tracking_gas"</span>
</pre>
</div>

<p>
We can also set the logging priority and the maximum depth to look inside
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">#@description Logging level for validator</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">validation.validator_params.max_depth : integer = 100</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging level for validator</span>
validation.validator_params.logging.priority : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)
</pre>
</div>
</div></li></ul></li></ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">3.3</span> Source vertices</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Since there are two types of source strips namely "internal" and "external" with
different size and then different isotope mass, we first define independent
vertices for each of this model and then use a <code>genvtx::combined_vg</code> model to
combine with appropriate weights. These vertices are only available with
SuperNEMO geometry version greater than 2.0.
</p>

<p>
Insert preamble
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of vertex generators</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-4">
<h4 id="orgheadline16"><span class="section-number-4">3.3.1</span> Internal source strips</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li><p>
Generate vertex from the bulk volume of the source foil:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_internal_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk volume of the inner source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='source_strip' module={*} strip=[1;34]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex from the surface of the source foil:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_internal_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the inner source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='source_strip' module={*} strip=[1;34]"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box back face activation</span>
mode.surface.back  : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box front face activation</span>
mode.surface.front : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">3.3.2</span> External source strips</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li><p>
Generate vertex from the bulk volume of the source foil:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_external_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk volume of the outer source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='source_strip' module={*} strip={0;35}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>

<li><p>
Generate vertex from the surface of the source foil:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_external_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the outer source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='source_strip' module={*} strip={0;35}"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box back face activation</span>
mode.surface.back  : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box front face activation</span>
mode.surface.front : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>
</ul>
</div>
</div>
