sngenvertex_manager.org
*** Combined vertex

- Generate vertex from both the bulk volume of all the source foils:
  #+BEGIN_SRC shell
    [name="source_pads_bulk" type="genvtx::combined_vg"]

    #@config Vertex generation from the bulk volume of the source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Vertex generator names
    generators : string[2]  = "source_pads_external_bulk" "source_pads_internal_bulk"

    #@description Absolute weight of different generators
    generators.source_pads_external_bulk.absolute_weight : real = 0.054
    generators.source_pads_internal_bulk.absolute_weight : real = 1.0
  #+END_SRC

- Generate vertex from the surface of all the source foils:
  #+BEGIN_SRC shell
    [name="source_pads_surface" type="genvtx::combined_vg"]

    #@config Vertex generation from the surface of the source pads

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"warning")

    #@description Geometry version requirement (not working with version lower than 2.0)
    geometry.setup_requirement : string = "snemo::demonstrator(>=3)"

    #@description Vertex generator names
    generators : string[2] = \
      "source_pads_internal_surface" \
      "source_pads_external_surface"

    #@description Absolute weight of different generators
    generators.source_pads_external_surface.absolute_weight : real  = 0.054
    generators.source_pads_internal_surface.absolute_weight : real  = 1.0
  #+END_SRC
** External vertices
:PROPERTIES:
:HEADER-ARGS: :tangle hall_vg.lis
:END:

Insert preamble
#+BEGIN_SRC shell
  #@description A list of vertex generators
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

- Generate vertex from the surface of the hall walls
  #+BEGIN_SRC shell
    [name="experimental_hall_surface" type="genvtx::box_model_vg"]

    #@config Vertex generation from the surface of the experimental hall

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"notice")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='hall'"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "surface"

    #@description Surface mode box back face activation
    mode.surface.back   : boolean = true

    #@description Surface mode box front face activation
    mode.surface.front  : boolean = true

    #@description Surface mode box bottom face activation
    mode.surface.bottom : boolean = true

    #@description Surface mode box top face activation
    mode.surface.top    : boolean = true

    #@description Surface mode box left face activation
    mode.surface.left   : boolean = true

    #@description Surface mode box right face activation
    mode.surface.right  : boolean = true
  #+END_SRC

- Generate vertex from the volume of the hall
  #+BEGIN_SRC shell
    [name="experimental_hall_bulk" type="genvtx::box_model_vg"]

    #@config Vertex generation from the volume of the experimental hall

    #@description Logging priority
    logging.priority  : string = @variant(core:logging_priority|"notice")

    #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
    origin : string = "category='hall'"

    #@description Generation mode ("surface" or "bulk")
    mode   : string = "bulk"
  #+END_SRC
** Calibration source vertices
:PROPERTIES:
:HEADER-ARGS: :tangle calibration_vg.lis
:END:

Insert preamble
#+BEGIN_SRC shell
  #@description A list of source calibration vertex generators
  #@key_label   "name"
  #@meta_label  "type"
#+END_SRC

#+BEGIN_SRC shell
  [name="calibration_source_bulk" type="genvtx::cylinder_model_vg"]

  #@config Vertex generation from the bulk of the calibration sources

  #@description Logging priority
  logging.priority : string = @variant(core:logging_priority|"warning")

  #@description Geometry origin of vertex in term of geometry category and addresses (geom ID)
  origin : string = "category='calibration_spot' module={*} path={*} position={*}"

  #@description Generation mode ("surface" or "bulk")
  mode   : string = "bulk"
#+END_SRC
