sngenvertex_manager.html

<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">3.3.3</span> Combined vertex</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li><p>
Generate vertex from both the bulk volume of all the source foils:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::combined_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the bulk volume of the source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Vertex generator names</span>
generators : <span class="org-variable-name">string</span>[2]  = <span class="org-string">"source_strips_external_bulk"</span> <span class="org-string">"source_strips_internal_bulk"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Absolute weight of different generators</span>
generators.source_strips_external_bulk.absolute_weight : <span class="org-variable-name">real</span> = 0.054
generators.source_strips_internal_bulk.absolute_weight : <span class="org-variable-name">real</span> = 1.0
</pre>
</div></li>

<li><p>
Generate vertex from the surface of all the source foils:
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"source_strips_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::combined_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the source strips</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"warning"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry version requirement (not working with version lower than 2.0)</span>
geometry.setup_requirement : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::demonstrator(&gt;=3)"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Vertex generator names</span>
generators : <span class="org-variable-name">string</span>[2] = <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"source_strips_internal_surface"</span> <span class="org-sh-escaped-newline">\</span>
  <span class="org-string">"source_strips_external_surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Absolute weight of different generators</span>
generators.source_strips_external_surface.absolute_weight : <span class="org-variable-name">real</span>  = 0.054
generators.source_strips_internal_surface.absolute_weight : <span class="org-variable-name">real</span>  = 1.0
</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">3.4</span> External vertices</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Insert preamble
</p>
<div class="org-src-container">

<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A list of vertex generators</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
Generate vertex from the surface of the hall walls
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"experimental_hall_surface"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the surface of the experimental hall</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"notice"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='hall'"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"surface"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box back face activation</span>
mode.surface.back   : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box front face activation</span>
mode.surface.front  : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box bottom face activation</span>
mode.surface.bottom : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box top face activation</span>
mode.surface.top    : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box left face activation</span>
mode.surface.left   : <span class="org-variable-name">boolean</span> = true

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Surface mode box right face activation</span>
mode.surface.right  : <span class="org-variable-name">boolean</span> = true
</pre>
</div></li>

<li><p>
Generate vertex from the volume of the hall
</p>
<div class="org-src-container">

<pre class="src src-shell">[<span class="org-variable-name">name</span>=<span class="org-string">"experimental_hall_bulk"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genvtx::box_model_vg"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Vertex generation from the volume of the experimental hall</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority  : <span class="org-variable-name">string</span> = @variant(core:logging_priority|<span class="org-string">"notice"</span>)

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Geometry origin of vertex in term of geometry category and addresses (geom ID)</span>
origin : <span class="org-variable-name">string</span> = <span class="org-string">"category='hall'"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generation mode ("surface" or "bulk")</span>
mode   : <span class="org-variable-name">string</span> = <span class="org-string">"bulk"</span>
</pre>
</div></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under <i class="fa fa-github-alt"></i> version control - commit <a href="https://github.com/xgarrido/snemo_simulation_configuration/commit/a31847f17af5483c3e262731b882fb28f4a8eb91">a31847f</a> - 2015-09-22
</div>
</body>
</html>
